---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisBuildingData
source: html/d7cf1444-abc3-3d97-14ab-f2455483d20d.htm
---
# Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisBuildingData Property

Building Data.

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisBuildingData { get; }
```